## == Packages ==

cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/core'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'neovim/neovim'

# Languages
brew 'lua'
brew 'python'
brew 'python3'
brew 'cmake'
brew 'markdown'

# Dotfiles sync tool
brew 'thoughtbot/formulae/rcm'

# Version control
brew 'git'
brew 'git-extras'

# Programming tools
brew 'vim'
brew 'neovim'
brew 'macvim'
brew 'the_silver_searcher'
brew 'ctags'
brew 'cscope'
brew 'homebrew/dupes/grep', args: ['default-names']
brew 'homebrew/dupes/rsync'
brew 'lesspipe', args: ['syntax-highlighting']
brew 'markdown'
brew 'ssh-copy-id'
brew 'jq'
brew 'd12frosted/emacs-plus/emacs-plus'
brew 'emacs'

# Terminal
brew 'readline'
brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'terminal-notifier'
brew 'fswatch'
brew 'tree'
brew 'watch'
brew 'fasd'
brew 'sshrc'
brew 'asciinema'
brew 'lorem'
brew 'browser'

# Libraries
brew 'boost'

# Tmux
brew 'tmux'
brew 'reattach-to-user-namespace', args: ['with-wrap-pbcopy-and-pbpaste']

# Diff tools
brew 'colordiff'
brew 'wdiff'

# Other tools
brew 'mas'

## == Casks ==

# Essential
cask 'dropbox'
cask 'google-chrome'

# Mac Utilities
cask '1password'
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'daisydisk'
cask 'textexpander'
cask 'the-unarchiver'
cask 'hammerspoon'
cask 'shortcat'
cask 'popclip'
cask 'ssh-tunnel-manager'
mas 'Noizio', id: 928871589
mas 'Yoink', id: 457622435

# Developer
mas 'Xcode', id: 497799835
cask 'dash'
cask 'r'
cask 'rstudio'
cask 'iterm2-beta'
cask 'intellij-idea-ce'

# Office
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers', id: 409203825

# Organizer
cask 'omnifocus'
cask 'fantastical'
cask 'evernote'
cask 'skitch'
cask 'vitamin-r'
cask 'microsoft-office'

# Media
cask 'vlc'

# Social
cask 'skype'
cask 'franz'

# Java
cask 'java' unless system '/usr/libexec/java_home --failfast'

# Fonts
cask 'font-fira-mono'

# Keyboard
cask 'karabiner-elements'

# Haskell
cask 'haskell-platform'
brew 'pandoc'

# Anaconda
cask 'anaconda'

# TeX
cask 'mactex'

# Reading
cask 'skim'
