tap 'homebrew/cask-fonts'

# Basic stuff
brew 'rcm'
brew 'python'

brew 'cookiecutter'
brew 'flake8'
brew 'gh'
brew 'git'
brew 'grep'
brew 'jq'
brew 'lesspipe'
brew 'mypy'
brew 'neovim'
brew 'node'
brew 'nvim'
brew 'pipenv'
brew 'pipx'
brew 'pyenv'
brew 'the_silver_searcher'
brew 'vim'
brew 'yapf'

# Terminal
brew 'bash'
brew 'browser'
brew 'colordiff'
brew 'fasd'
brew 'reattach-to-user-namespace'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wdiff'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# Other tools
brew 'mas'

## == Casks ==

cask '1password'
cask 'alfred'
cask 'anylist'
cask 'appcleaner'
cask 'bartender'
cask 'daisydisk'
cask 'dash'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'google-cloud-sdk' unless system 'gcloud --version'
cask 'google-drive'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepingyouawake'
cask 'logi-options-plus'
cask 'logitech-g-hub'
cask 'mullvadvpn'
cask 'notion'
cask 'popclip'
cask 'slack'
cask 'textexpander'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
mas 'Noizio', id: 928871589
mas 'Yoink', id: 457622435
mas 'Things 3', id: 904280696
mas 'Bear', id: 1091189122
mas 'Be Focused Pro - Focus Timer', id: 961632517

# Fonts
cask 'font-fira-code'
