# Modern utilities for common shell tasks
brew 'bat'     # Nicer cat
brew 'eza'     # Nicer ls
brew 'fd'      # Nicer find
brew 'procs'   # Nicer ps
brew 'ripgrep' # Nicer grep
brew 'sd'      # Nicer sed
brew 'zoxide'  # Nicer cd

# Shell enhancements
brew 'starship' # Prompt
brew 'fzf'      # Another fuzzy finder
brew 'tmux'
tap 'cormacrelf/tap'
brew 'cormacrelf/tap/dark-notify'

# Git
brew 'git'
brew 'gh'                   # GitHub
brew 'git-absorb'           # Automatic git commit --fixup
brew 'git-delta'            # Nicer diff view for git
brew 'difftastic'           # Structural diffing
tap 'jesseduffield/lazygit' # TUI for git
brew 'jesseduffield/lazygit/lazygit'

# Filter processors for various file types
brew 'jq'     # JSON processor
brew 'yq'     # YAML processor
brew 'miller' # CSV/JSON processor

# Vim
brew 'neovim'
brew 'tree-sitter'

# Node
brew 'node'

# Python
brew 'python'
brew 'uv'

# Scripting tools
brew 'entr'               # File watcher for running commands
brew 'watch'              # For running commands on a regular interval
brew 'gum'                # Better shell script inputs and TUI
brew 'hyperfine'          # Better benchmarking
brew 'terminal-notifier'  # Send macOS notifications from the terminal
brew 'llm'                # Interacting with LLMs on the command line
brew 'pdfgrep'            # Searching in PDFs

# Misc
brew 'gmailctl' # Gmail filter management
brew 'tokei'    # Code statistics

# Casks and App Store apps
cask '1password-cli'
cask '1password'
cask 'appcleaner'
cask 'claude'
cask 'cleanshot'
cask 'docker'
cask 'espanso'
cask 'google-chrome'
cask 'google-drive'
cask 'hammerspoon'
cask 'ghostty'
cask 'jordanbaird-ice'
cask 'logi-options+'
cask 'obsidian'
cask 'reader'
cask 'slack'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
mas 'Noizio', id: 928871589
mas 'Things 3', id: 904280696
mas 'Yoink', id: 457622435

# Fonts
cask 'font-monaspace'
cask 'font-victor-mono-nerd-font'

# vim: ft=ruby
