tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'

# Basic stuff
brew 'python'
brew 'cookiecutter'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'grep'
brew 'jq'
brew 'mypy'
brew 'neovim'
brew 'node'
brew 'pipenv'
brew 'pipx'
brew 'pyenv'
brew 'fd'
brew 'ripgrep'
brew 'black'

# Terminal
brew 'bash'
brew 'browser'
brew 'colordiff'
brew 'reattach-to-user-namespace'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'

# Other tools
brew 'mas'

## == Casks ==

cask '1password'
cask 'anylist'
cask 'appcleaner'
cask 'bartender'
cask 'daisydisk'
cask 'dash'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'google-drive'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepingyouawake'
cask 'logi-options-plus'
cask 'microsoft-office'
cask 'mullvadvpn'
cask 'notion'
cask 'slack'
cask 'signal'
cask 'textexpander'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'wd-security'
cask 'zoom'
mas 'Noizio', id: 928871589
mas 'Yoink', id: 457622435
mas 'Things 3', id: 904280696
mas 'Be Focused Pro - Focus Timer', id: 961632517
mas 'PopClip', id: 445189367

# Fonts
cask 'font-fira-code'
cask 'font-meslo-lg-nerd-font'
